In [1]:
import pandas as pd

In [2]:
# concatenation and joining of the datasets

s1 = pd.Series(['A','B','A','B','C'])
s2 = pd.Series([10,20,30,40,50])

data1 = pd.DataFrame({'Name':s1, 'Lemonades':s2})

s1 = pd.Series(['A','B','A','B','C'])
s2 = pd.Series([11,22,33,44,55])

data2 = pd.DataFrame({'Name':s1, 'Lemon':s2})

In [3]:
data1

  Name  Lemonades
0    A         10
1    B         20
2    A         30
3    B         40
4    C         50

In [4]:
data2

  Name  Lemon
0    A     11
1    B     22
2    A     33
3    B     44
4    C     55

In [5]:
pd.concat([data1,data2])

  Name  Lemonades  Lemon
0    A       10.0    NaN
1    B       20.0    NaN
2    A       30.0    NaN
3    B       40.0    NaN
4    C       50.0    NaN
0    A        NaN   11.0
1    B        NaN   22.0
2    A        NaN   33.0
3    B        NaN   44.0
4    C        NaN   55.0

In [ ]:
'''above the common columns are counted just only once
The specific areas are left as NaN due to column name is different
and implies for that different columns the data does not exists
in the respective dataframes. 

No values exist inside the Data1 for Lemon 
No values exist inside the Data2 for Lemonade
hence on concatenation the missing values for each other will be
filled as the NaN

'''

In [6]:
data1.append(data2)

AttributeError: 'DataFrame' object has no attribute 'append'

In [ ]:
#early versions of pandas had the function for appending the dataframes object
#gives us the results as same as the concat

In [7]:
# merging the data1 and data2

pd.merge(data1,data2,on='Name')

  Name  Lemonades  Lemon
0    A         10     11
1    A         10     33
2    B         20     22
3    B         20     44
4    A         30     11
5    A         30     33
6    B         40     22
7    B         40     44
8    C         50     55

In [ ]:
#this is kind of a 1NF 
#we cannot see NaN here.
#merge shows you the matching records only.

In [8]:
#join on index

# join is performed on the basis of the common attribute

#the join is the sql left join some kind of

data1.join(data2.set_index('Name'), on='Name')

  Name  Lemonades  Lemon
0    A         10     11
0    A         10     33
1    B         20     22
1    B         20     44
2    A         30     11
2    A         30     33
3    B         40     22
3    B         40     44
4    C         50     55

In [ ]:
#left join: only 1st all rows and common with the right ones

# merge is inner join. join is the left join , no need to set the common index